efenocchi/STM32-new_project/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "psw.h"
#include "cmsis_os.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "semphr.h"
#include "stm32l475e_iot01.h"
#include "stm32l475e_iot01_tsensor.h"
#include "stm32l475e_iot01_psensor.h"
#include "stm32l475e_iot01_hsensor.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define TERMINAL_USE

/* Update SSID and PASSWORD with own Access point settings */

//#define SSID
//#define PASSWORD ""


uint8_t RemoteIP[] = {192,168,1,4};
#define RemotePORT	8002

#define WIFI_WRITE_TIMEOUT 10000
#define WIFI_READ_TIMEOUT  10000

#define CONNECTION_TRIAL_MAX          10

#if defined (TERMINAL_USE)
#define TERMOUT(...)  printf(__VA_ARGS__)
#else
#define TERMOUT(...)
#endif


extern I2C_HandleTypeDef hI2cHandler;
VL53L0X_Dev_t Dev =
{
  .I2cHandle = &hI2cHandler,
  .I2cDevAddr = PROXIMITY_I2C_ADDRESS
};


/* Private variables ---------------------------------------------------------*/
#if defined (TERMINAL_USE)
extern UART_HandleTypeDef hDiscoUart;
#endif /* TERMINAL_USE */
static uint8_t RxData [500];


/* Private function prototypes -----------------------------------------------*/
#if defined (TERMINAL_USE)
#ifdef __GNUC__
/* With GCC, small TERMOUT (option LD Linker->Libraries->Small TERMOUT
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */
#endif /* TERMINAL_USE */

static void SystemClock_Config(void);



extern  SPI_HandleTypeDef hspi;

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */

extern  SPI_HandleTypeDef hspi;

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c2;

QSPI_HandleTypeDef hqspi;

SPI_HandleTypeDef hspi3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;


/* Definitions for serialPrintTask*/

osThreadId_t serialTaskHandle;
const osThreadAttr_t serialTask_attributes = {
  .name = "serialTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 512 * 4
};


/* Definitions for statisticsTask*/
osThreadId_t statisticsTaskHandle;
const osThreadAttr_t statisticsTask_attributes = {
  .name = "statisticsTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 232 * 4
};

/* Definitions for dewpointTask */
osThreadId_t dewpointTaskHandle;
const osThreadAttr_t dewpointTask_attributes = {
  .name = "dewpointTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 232 * 4
};

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 232 * 4
};
/* Definitions for myTask02 */
osThreadId_t myTask02Handle;
const osThreadAttr_t myTask02_attributes = {
  .name = "myTask02",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 232 * 4
};

/* Definitions for proximityThread */
osThreadId_t proximityThreadHandle;
const osThreadAttr_t proximityThread_attributes = {
  .name = "proximityThread",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 440 * 4
};
/* USER CODE BEGIN PV */

struct sharedValues_t{
int temperature_val1;
int temperature_val2;
float array_temp[5];
float average_temerature;
int n_elements_temp;
int check_mean_temp;

int humidity_val1;
int humidity_val2;
float array_humidity[5];
float average_humidity;
int n_elements_humidity;
int check_mean_humidity;

int pressure_val1;
int pressure_val2;
float array_pressure[5];
float average_pressure;
int n_elements_pressure;
int check_mean_pressure;

int proximity;
int dewpoint;
int enableDew;



osSemaphoreId_t mutex;
osSemaphoreId_t primo;
osSemaphoreId_t secondo;


}sharedValues;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_I2C2_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SPI3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);

static void VL53L0X_PROXIMITY_MspInit(void);
static uint16_t VL53L0X_PROXIMITY_GetDistance(void);
static void VL53L0X_PROXIMITY_Init(void);

void StartDefaultTask(void *arguments);
void StartTask02(void *arguments);
void Proximity_Test(void *arguments);
void StartDewpointTask(void *arguments);
void ComputeStatistics(void *arguments);
void SerialPrint(void *arguments);


/* USER CODE BEGIN PFP */


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


