efenocchi/STM32-new_project/Core/Src/main.c
				  }
				  osSemaphoreRelease(sv->mutex);
				  //if we had any problems the mutex won't be used
				  if (ret != WIFI_STATUS_OK){
					TERMOUT("> ERROR : Failed to Send Data, connection closed\n");
					 HAL_GPIO_WritePin(ARD_D9_GPIO_Port, ARD_D9_Pin, GPIO_PIN_SET);//0

					break;
				  }
				}
		  }
		  else
		  {
			TERMOUT("> ERROR : Failed to Receive Data, connection closed\n");
			 HAL_GPIO_WritePin(ARD_D9_GPIO_Port, ARD_D9_Pin, GPIO_PIN_SET);//0
			 break;
		  }

		  HAL_Delay(500);
	}

		  return 1;
}





/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *arguments)
{

	while(1){
			uint8_t  MAC_Addr[6];
			uint8_t  IP_Addr[4];

			int32_t Socket = -1;

			int16_t Trials = CONNECTION_TRIAL_MAX;


			/*Initialize  WIFI module */
			  if(WIFI_Init() ==  WIFI_STATUS_OK)
			  {
					TERMOUT("> WIFI Module Initialized.\n");
					if(WIFI_GetMAC_Address(MAC_Addr) == WIFI_STATUS_OK)
					{
					  TERMOUT("> es-wifi module MAC Address : %X:%X:%X:%X:%X:%X\n",
							   MAC_Addr[0],
							   MAC_Addr[1],
							   MAC_Addr[2],
							   MAC_Addr[3],
							   MAC_Addr[4],
							   MAC_Addr[5]);
					}
					else
					{
					  TERMOUT("> ERROR : CANNOT get MAC address\n");
					  BSP_LED_On(LED2);
					}

					if( WIFI_Connect(SSID, PASSWORD, WIFI_ECN_WPA2_PSK) == WIFI_STATUS_OK)
					{
					  TERMOUT("> es-wifi module connected \n");
					  if(WIFI_GetIP_Address(IP_Addr) == WIFI_STATUS_OK)
					  {
						TERMOUT("> es-wifi module got IP Address : %d.%d.%d.%d\n",
							   IP_Addr[0],
							   IP_Addr[1],
							   IP_Addr[2],
							   IP_Addr[3]);

						TERMOUT("> Trying to connect to Server: %d.%d.%d.%d:%d ...\n",
							   RemoteIP[0],
							   RemoteIP[1],
							   RemoteIP[2],
							   RemoteIP[3],
											 RemotePORT);

						while (Trials--)
						{
						  if( WIFI_OpenClientConnection(0, WIFI_TCP_PROTOCOL, "TCP_CLIENT", RemoteIP, RemotePORT, 0) == WIFI_STATUS_OK)
						  {
							TERMOUT("> TCP Connection opened successfully.\n");
							Socket = 0;
							 HAL_GPIO_WritePin(ARD_D9_GPIO_Port, ARD_D9_Pin, GPIO_PIN_RESET);
							break;
						  }

						}
						if(Socket == -1)
						{
						  TERMOUT("> ERROR : Cannot open Connection\n");
						  BSP_LED_On(LED2);
						}
					  }
					  else
					  {
						TERMOUT("> ERROR : es-wifi module CANNOT get IP address\n");
						BSP_LED_On(LED2);
					  }
					}
					else
					{
					  TERMOUT("> ERROR : es-wifi module NOT connected\n");
					  BSP_LED_On(LED2);
					}
			  }
			  else
			  {
				TERMOUT("> ERROR : WIFI Module cannot be initialized.\n");
				BSP_LED_On(LED2);
			  }


		if(Socket!=-1){
			int error_connession=0;
			for(;;){

				error_connession = controlla_valori_telefono(&sharedValues,Socket);

				//if we have an error after reaching the connection, we try to connect the board again
				//it will always be 1
				if(error_connession==1){
					//wait 3 seconds and try to connect to the device again
					HAL_Delay(3000);
					break;
				}

			}
		}

	//wait 5 seconds and try to connect to the device again
	HAL_Delay(5000);
	}
}

/* USER CODE BEGIN Header_StartTask02 */
/**
* @brief Function implementing the myTask02 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask02 */

//Aggiorna i valori dei sensori così se vengono richiesti dall'app sono consistenti
void stampa(struct sharedValues_t *sv){
	 osSemaphoreAcquire(sv->mutex, portMAX_DELAY);

		float temperature,humidity,pressure;
		float separa = 0;
		int val1,val2;


		temperature = BSP_TSENSOR_ReadTemp();
		humidity = BSP_HSENSOR_ReadHumidity();
		pressure = BSP_PSENSOR_ReadPressure();

		if(temperature>27){
			HAL_GPIO_WritePin(ARD_D5_GPIO_Port, ARD_D5_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(ARD_D10_GPIO_Port, ARD_D10_Pin, GPIO_PIN_SET);
		}
		else{
			HAL_GPIO_WritePin(ARD_D5_GPIO_Port, ARD_D5_Pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(ARD_D10_GPIO_Port, ARD_D10_Pin, GPIO_PIN_RESET);
		}
//temperature
		val1 = temperature;
		separa = temperature - val1;
		val2 = trunc(separa * 100);
		sv->temperature_val1 = val1;
		sv->temperature_val2 = val2;
		if(sv->n_elements_temp<5){
			sv->array_temp[sv->n_elements_temp]=temperature;
			sv->n_elements_temp += 1;

		}

//humidity
		val1 = humidity;
		separa = humidity - val1;
		val2 = trunc(separa * 100);
		sv->humidity_val1 = val1;
		sv->humidity_val2 = val2;
		if(sv->n_elements_humidity<5){
			sv->array_humidity[sv->n_elements_humidity]=humidity;
			sv->n_elements_humidity +=1;
		}

//pressure
		val1 = pressure;
		separa = pressure - val1;
		val2 = trunc(separa * 100);
		sv->pressure_val1 = val1;
		sv->pressure_val2 = val2;
		if(sv->n_elements_pressure<5){
			sv->array_pressure[sv->n_elements_pressure]=pressure;
			sv->n_elements_pressure +=1;
		}


	  osSemaphoreRelease(sv->mutex);

}
void StartTask02(void *arguments)
{
  /* USER CODE BEGIN StartTask02 */
  /* Infinite loop */
  for(;;)
  {
	  stampa(&sharedValues);
	  osDelay(500);
  }
  /* USER CODE END StartTask02 */
}

void aggiorna_contatore(struct sharedValues_t *sv){
	uint32_t ret = 0;
	uint16_t prox_value = 0;


	//prendo il mutex
	osSemaphoreAcquire(sv->mutex, portMAX_DELAY);

	prox_value = VL53L0X_PROXIMITY_GetDistance();
	//printf("DISTANCE is = %d mm \n", prox_value);

	sv->proximity = prox_value;
	if(prox_value<100)
		HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);
	osSemaphoreRelease(sv->mutex);

}

void Proximity_Test(void *arguments)
{

  printf("\n*************************************************************\n");
  printf("\n********************** Proximity Test ************************\n");
  printf("\n*************************************************************\n\n");


  while(1)
  {
	  	  aggiorna_contatore(&sharedValues);
	  	  HAL_Delay(1000);

  }

}

//acquisisce il tasto e stampa su seriale il valore di rugiada calcolato
void stampaDewpoint(struct sharedValues_t *sv){
	int dewpoint=-1;
	char msg_d[30] = "";
	float hum_f,temp_f;

		osSemaphoreAcquire(sv->mutex, portMAX_DELAY);

		hum_f = sv->humidity_val1;
		temp_f = sv->temperature_val1;
		dewpoint = (pow(hum_f/100, 0.125)*(112+temp_f*0.9)+(0.1*temp_f)-112);
		sv->dewpoint=dewpoint;

