efenocchi/STM32-new_project/Core/Src/main.c
		if(sv->enableDew==1){

			snprintf(msg_d,30," DEWPOINT = %d\n\r", dewpoint);
			HAL_UART_Transmit(&huart1, (uint8_t*) msg_d, sizeof(msg_d), 1000);
			sv->enableDew=0;
		}
		osSemaphoreRelease(sv->mutex);


}

void StartDewpointTask(void *arguments){
	/*USER CODE BEGIN StartDewpointTask*/
	/* Infinite loop */
	for(;;)
	{
		stampaDewpoint(&sharedValues);
		 osDelay(1000);
	}
	/* USER CODE END StartDewpointTask */
}

//Faccio statistiche sui dati campionati e salvati da altri thread
void computeAndUpdate(struct sharedValues_t *sv){
	int i;

	osSemaphoreAcquire(sv->mutex, portMAX_DELAY);
	if(sv->n_elements_temp==5){
		sv->average_temerature=0;
		for(i=0;i<5;i++){
			sv->average_temerature = sv->average_temerature + sv->array_temp[i];
		}

		sv->average_temerature = sv->average_temerature / 5;
		sv->check_mean_temp=1;
	}


	if(sv->n_elements_pressure==5){
		sv->average_pressure=0;
		for(i=0;i<5;i++){
			sv->average_pressure = sv->average_pressure + sv->array_pressure[i];
		}
		sv->average_pressure = sv->average_pressure / 5;
		sv->check_mean_pressure=1;
	}


	if(sv->n_elements_humidity==5){
		sv->average_humidity=0;
		for(i=0;i<5;i++){
			sv->average_humidity = sv->average_humidity + sv->array_humidity[i];
		}
		sv->average_humidity = sv->average_humidity / 5;
		sv->check_mean_humidity=1;
	}

	osSemaphoreRelease(sv->mutex);

}

void ComputeStatistics(void *arguments){

	for(;;){
		computeAndUpdate(&sharedValues);

		osDelay(1000);
	}
}

//stampa valori sulla seria, quando disponibili stampa anche i valori statistici
void checkAndPrint(struct sharedValues_t *sv){

	osSemaphoreAcquire(sv->mutex, portMAX_DELAY);

	char msg[100] = "";
	char msg1[100] = "";
	char msg2[100] = "";
	char msg3[100] = "";
	char msg4[100] = "";

	int i;
	float separa;
	int val1,val2;


	snprintf(msg1,100,"Temperature = %d.%02d\n\r", sv->temperature_val1, sv->temperature_val2);
	HAL_UART_Transmit(&huart1, (uint8_t*) msg1, sizeof(msg1), 1000);


	snprintf(msg2,100,"Humidity = %d.%02d\n\r", sv->humidity_val1, sv->humidity_val2);
	HAL_UART_Transmit(&huart1, (uint8_t*) msg2, sizeof(msg2), 1000);


	snprintf(msg3,100,"Pressure = %d.%02d hPa\n\r", sv->pressure_val1, sv->pressure_val2);
	HAL_UART_Transmit(&huart1, (uint8_t*) msg3, sizeof(msg3), 1000);


	snprintf(msg4,100,"Distance = %d mm\n\r", sv->proximity);
	HAL_UART_Transmit(&huart1, (uint8_t*) msg4, sizeof(msg4), 1000);


	if(sv->n_elements_temp==5 && sv->check_mean_temp==1 ){
		val1 = sv->average_temerature;
		separa = sv->average_temerature - val1;
		val2 = trunc(separa * 100);
		snprintf(msg,100,"Average Temperature = %d.%02d\n\r", val1, val2);
		HAL_UART_Transmit(&huart1, (uint8_t*) msg, sizeof(msg), 1000);

		sv->n_elements_temp=0;
		sv->check_mean_temp=0;
	}

	if(sv->n_elements_humidity==5 && sv->check_mean_humidity==1){
		val1 = sv->average_humidity;
		separa = sv->average_humidity - val1;
		val2 = trunc(separa * 100);
		snprintf(msg,100,"Average Humidity = %d.%02d\n\r", val1, val2);
		HAL_UART_Transmit(&huart1, (uint8_t*) msg, sizeof(msg), 1000);

		sv->n_elements_humidity=0;
		sv->check_mean_humidity=0;
	}

	if(sv->n_elements_pressure==5 && sv->check_mean_pressure==1){
		val1 = sv->average_pressure;
		separa = sv->average_pressure - val1;
		val2 = trunc(separa * 100);
		snprintf(msg,100,"Average Pressure = %d.%02d\n\r", val1, val2);
		HAL_UART_Transmit(&huart1, (uint8_t*) msg, sizeof(msg), 1000);

		sv->n_elements_pressure=0;
		sv->check_mean_pressure=0;
	}
	osSemaphoreRelease(sv->mutex);
}


void SerialPrint(void *arguments){


	for(;;){

		checkAndPrint(&sharedValues);
		osDelay(2000);
	}
}



/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case (GPIO_PIN_1):
    {
      SPI_WIFI_ISR();
      break;
    }
    case (BUTTON_EXTI13_Pin):
    {
    	if (HAL_GPIO_ReadPin(BUTTON_EXTI13_GPIO_Port, BUTTON_EXTI13_Pin) != GPIO_PIN_SET){
    		sharedValues.enableDew=1;
    	}
    }

    default:
    {
      break;
    }
  }
}

void SPI3_IRQHandler(void)
{
  HAL_SPI_IRQHandler(&hspi);
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
